Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: So, if both states are active it would return 3, for example.
es: De este modo, si ambos estados están activos devolvería por ejemplo un valor 3.

source: Using remote files
es: Usando archivos remotos

source: PHP transparently supports HTTP cookies.
es: PHP soporta transparentemente cookies HTTP.

source: Cookies are a mechanism for storing data in the remote browser and thus tracking or identifying return users.
es: Las Cookies son un mecanismo que sirve para almacenar datos en el navegador del usuario remoto, para así poder identificar al usuario cuando vuelva.

source: You can set cookies using the setcookie() function.
es: Se pueden poner cookies usando la función setcookies().

source: Cookies are part of the HTTP header, so setcookie() must be called before any output is sent to the browser.
es: Las Cookies son parte de la cabecera HTTP, por tanto la función setcookie() debe ser llamada antes de que se produzca cualquier salida al navegador.

source: This is the same limitation that header() has.
es: Esta limitación es la misma a la de la función header().

source: You can use the output buffering functions to delay the script output until you have decided whether or not to set any cookies or send any headers.
es: Se pueden usar las funciones de almacenamiento intermedio del resultado para retrasar el resultado del script hasta que hayas decidido mandar o no una cookie o cabecera.

source: Any cookies sent to you from the client will automatically be turned into a PHP variable just like GET and POST method data, depending on the register_globals and variables_order configuration variables.
es: Cualquier cookie enviada a ti desde el cliente, automáticamente se convertirá en una variable PHP igual como ocurre con los métodos de datos GET y POST, dependiendo de las variables de configuración register_globals y variables_order.

source: If you wish to assign multiple values to a single cookie, just add [] to the cookie name.
es: Si deseas asignar multiples valores a una cookie simple, añade simplemente [] a el nombre de la cookie.

source: In PHP 4.1.0 and later, the $_COOKIE auto-global array will always be set with any cookies sent from the client. $HTTP_COOKIE_VARS is also set in earlier versions of PHP when the track_vars configuration variable is set.
es: En PHP 4.1.0 y posteriores, la array auto-global $_COOKIE será siempre actualizada con cualquier cookie mandada por el cliente. $HTTP_COOKIE_VARS es tambien actualizada en versiones anteriores de PHP cuando la variable de configuración track_vars esté activada.

source: For more details, including notes on browser bugs, see the setcookie() function.
es: Para más detalles ver la función setcookie().

source: HTTP authentication with PHP
es: Autentificación HTTP con PHP

source: Handling file uploads
es: Manejo de envío de ficheros

source: Chapter 18.
es: Capítulo 18.

source: The MAX_FILE_SIZE item cannot specify a file size greater than the file size that has been set in the upload_max_filesize ini-setting.
es: A MAX_FILE_SIZE no se le puede dar un valor mayor que el valor que se haya especificado en la directiva upload_max_filesize.

source: The default is 2 Megabytes.
es: Por defecto se tiene un límite de 2 MegaBytes.

source: If memory limit is enabled, larger memory_limit may be needed.
es: Si se ha activado el límite de memoria, se deben especificar un valor alto para memory_limit.

source: Make sure to set memory_limit large enough.
es: En cualquier caso, se debe asegurar un valor suficientemente grande para memory_limit.

source: If max_execution_time is set too small, script execution may be exceeded the value.
es: Si max_execution_time tiene un valor muy pequeño, la ejecución del script puede exceder este valor.

source: Make sure to set max_execution_time large enough.
es: De esta forma, se debe asegurar un valor suficientemente grande para max_execution_time.

source: Make sure to set post_max_size large enough.
es: Si post_max_size tiene un valor muy pequeño, los ficheros mas grandes a este valor, no podrán ser enviados.

source: Not validating which file you operate on may mean that users can access sensitive information in other directories.
es: Por ello, se debe asegurar un valor suficientemente grande para post_max_size.

source: Please note that the CERN httpd seems to strip off everything starting at the first whitespace in the content-type mime header it gets from the client.
es: No verificar que ficheros se estan manipulando puede tener como consecuencia que los usuarios puedan acceder a información sensible en otros directorios.

source: Due to the large amount of directory listing styles we cannot guarantee that files with exotic names (like containing spaces) are handled properly.
es: Si este es el caso, con el httpd de CERN no se soporta la funcionalidad de envío de ficheros.

source: Error Messages Explained
es: Manejo de envío de ficheros

source: Uploading multiple files
es: Envío de multiples ficheros

source: PHP is capable of receiving file uploads from any RFC-1867 compliant browser (which includes Netscape Navigator 3 or later, Microsoft Internet Explorer 3 with a patch from Microsoft, or later without a patch).
es: PHP es capaz de recibir envíos de archivo de cualquier navegador que cumpla la norma RFC-1867 (entre los que se incluyen Netscape Navigator 3 o posterior, Microsoft Internet Explorer 3 con un parche o posterior sin éste).

source: This feature lets people upload both text and binary files.
es: Ésta característica permite que los usuarios envien archivos de texto y binarios.

source: With PHP 's authentication and file manipulation functions, you have full control over who is allowed to upload and what is to be done with the file once it has been uploaded.
es: Mediante la autentificación y funciones de manejo de archivos de PHP, es posible un control total de quién puede enviar archivos y que se hace con éstos una vez recibidos.

source: See also the file_uploads, upload_max_filesize, upload_tmp_dir, and post_max_size directives in php.ini
es: Es importante destacar que PHP también soporta el método PUT para envío de archivos tal y como lo utiliza Netscape Composer y el cliente Amaya de W3C.

source: Note that PHP also supports PUT-method file uploads as used by Netscape Composer and W3C 's Amaya clients.
es: Una página de envío de archivos se puede crear mediante un formulario parecido a éste:

source: See the PUT Method Support for more details.
es: Formulario de envío de archivo

source: Example 18-1.
es: form enctype=" multipart / form-data "action="_URL_" method="post "input type="hidden" name="MAX_FILE_SIZE "value="1000" Send this file: input name="userfile "type="file" input type="submit "value="Send File" / form

source: File Upload Form
es: Aviso

source: Warning
es: En contrapartida, la configuracion de PHP relativa al tamaño maximo no puede ser obviada.

source: It is easy to circumvent this maximum.
es: Las variables definidas para los archivos enviados varian en función de la versión y configuración de PHP que se utilice.

source: The PHP-settings for maximum-size, however, cannot be fooled.
es: Las variables de las que hablamos a continuación serán definidas en la página destino despues de una recepción de fichero correcta.

source: The Variables defined for uploaded files differs depending on the PHP version and configuration.
es: Cuando track_vars este activado, el array $HTTP_POST_FILES / $_FILES se inicializará.

source: The autoglobal $_FILES exists as of PHP 4.1.0 The $HTTP_POST_FILES array has existed since PHP 4.0.0.
es: Por ultimo, las variables relacionadas seran inicializadas como globales cuando register_globals esté habilitado.

source: These arrays will contain all your uploaded file information.
es: Cabe señalar que el uso de las variables globales no esta recomendado en ningún caso.

source: If the PHP directive register_globals is on, related variable names will also exist. register_globals defaults to off as of PHP 4.2.0.
es: $HTTP_POST_FILES / $_FILES contienen la información sobre el fichero recibido.

source: The contents of $_FILES from our example script is as follows.
es: A continuación se describe el contenido de $HTTP_POST_FILES.

source: Note that this assumes the use of the file upload name userfile, as used in the example script above.
es: Se ha tomado el nombre 'userfile' para el fichero recibido tal y como se usaba en el script de ejemplo anterior:

source: The original name of the file on the client machine.
es: El nombre original del fichero en la máquina cliente.

source: The mime type of the file, if the browser provided this information.
es: El tipo mime del fichero (si el navegador lo proporciona).

source: An example would be "image / gif".
es: Un ejemplo podría ser "image / gif".

source: The size, in bytes, of the uploaded file.
es: El tamaño en bytes del fichero recibido.

source: The temporary filename of the file in which the uploaded file was stored on the server.
es: El nombre del fichero temporal que se utiliza para almacenar en el servidor el archivo recibido.

source: The error code associated with this file upload. ['error'] was added in PHP 4.2.0
es: A partir de PHP 4.1.0 se puede utilizar el variable corta $_FILES.

source: PHP 3 does not support $HTTP_POST_FILES.
es: Se ha tomado el nombre 'userfile' para el fichero recibido tal y como se usaba en el script de ejemplo del principio:

source: When register_globals is turned on in php.ini, additional variables are available.
es: $userfile - El nombre del fichero temporal que se utiliza para almacenar en el servidor el archivo recibido.

source: For example, $userfile_name will equal $_FILES[ 'userfile']['name'], $userfile_type will equal $_FILES['userfile']['type'], etc.
es: $userfile_size - El tamaño en bytes del fichero recibido.

source: Keep in mind that as of PHP 4.2.0, register_globals defaults to off.
es: $userfile_type - El tipo mime del fichero (si el navegador lo proporciona).

source: It 's preferred to not rely on this directive.
es: Un ejemplo podría ser "image / gif".

source: Files will by default be stored in the server 's default temporary directory, unless another location has been given with the upload_tmp_dir directive in php.ini.
es: Por defecto, los ficheros serán almacenados en el directorio temporal por defecto del servidor a no ser que se especifique otra localizacion con la directiva upload_tmp_dir en php.ini.

source: Setting it using putenv() from within a PHP script will not work.
es: El directorio temporal por defecto del servidor puede ser modificado cambiando el valor de la variable de entorno TMPDIR en el contexto en que se ejecuta PHP La configuración de las variables de entorno no se puede realizar en PHP a través de la función putenv().

source: This environment variable can also be used to make sure that other operations are working on uploaded files, as well.
es: Esta variable de entorio puede ser utilizada también para asegurarnos que otras operaciones con archivos recibidos están funcionando correctamente.

source: Example 18-2.
es: Ejemplo 18-2.

source: Validating file uploads
es: Verificando los archivos recibidos

source: See also the function entries for is_uploaded_file() and move_uploaded_file() for further information.
es: Los siguientes ejemplos son validos para versiones de PHP 4 superiores a la 4.0.2.

source: The following example will process the file upload that came from a form.
es: Veanse las funciones is_uploaded_file() y move_uploaded_file().

source: Here' s some more debugging info:\n"; print_r($_FILES);} else {print "Possible file upload attack!
es: ?php / / In PHP 4.1.0 or later, $_FILES should be used instead of $HTTP_POST_FILES. if (is_uploaded_file($HTTP_POST_FILES['userfile']['tmp_name'])) {copy($HTTP_POST_FILES['userfile']['tmp_name'], "/ place / to / put / uploaded / file");} else {echo "Possible file upload attack.

source: The PHP script which receives the uploaded file should implement whatever logic is necessary for determining what should be done with the uploaded file.
es: Filename: ". $HTTP_POST_FILES['userfile']['name'];} / * ...or... * / move_uploaded_file($HTTP_POST_FILES['userfile']['tmp_name']," / place / to / put / uploaded / file");?

source: You can for example use the $_FILES[ 'userfile']['size'] variable to throw away any files that are either too small or too big.
es: El script PHP que recibe el fichero, debe implementar la lógica necesaria para determinar que debe ser realizado con el fichero.

source: As of PHP 4.2.0, you could use $_FILES[ 'userfile']['error'] and plan your logic according to the error codes.
es: Se puede utilizar, por ejemplo, la variable $HTTP_POST_FILES[ 'userfile']['size'] para descartar los ficheros demasiado chicos o demasiado grandes; por otro lado, se puede usar la variable $HTTP_POST_FILES['userfile']['type'] para descartar los que no se ajusten a algun criterio de tipo.

source: Whatever the logic, you should either delete the file from the temporary directory or move it elsewhere.
es: Cualquiera que sea la logica que utilicemos, se debe borrar o mover el archivo del directorio temporal.

source: The file will be deleted from the temporary directory at the end of the request if it has not been moved away or renamed.
es: El archivo será borrado del directorio temporal al final de la petición si no se ha movido o renombrado.

source: Multiple files can be uploaded using different name for input.
es: Se pueden enviar multiples ficheros usando diferentes nombres (name) para los input.

source: It is also possible to upload multiple files simultaneously and have the information organized automatically in arrays for you.
es: Así mismo, es posible enviar varios archivos simultaneamente y tener organizada en arrays la información.

source: To do so, you need to use the same array submission syntax in the HTML form as you do with multiple selects and checkboxes:
es: Para hacer esto, se utiliza la misma sintáxis que cuando tenemos multiples "selects" o "checkboxes "en el formulario HTML:

source: Support for multiple file uploads was added in version 3.0.10.
es: El soporte para envío multiple de ficheros fue añadido en la versión 3.0.10.

source: Example 18-3.
es: Ejemplo 18-3.

source: When the above form is submitted, the arrays $_FILES[ 'userfile'], $_FILES['userfile']['name'], and $_FILES['userfile']['size'] will be initialized (as well as in $HTTP_POST_FILES for PHP version prior 4.1.0).
es: Así mismo pasa con $_FILES en PHP 4.1.0 o superiores y $HTTP_POST_VARS en PHP 3.

source: When register_globals is on, globals for uploaded files are also initialized.
es: Cuando register_globals esta activa, las variables globales para los archivos recibidos también son inicializadas.

source: Each of these will be a numerically indexed array of the appropriate values for the submitted files.
es: Cada uno de estos arrays tendrá en los índices numericos correspondientes los valores para cada fichero recibido.

source: For instance, assume that the filenames / home / test / review.html and / home / test / xwp.out are submitted.
es: Por ejemplo, si tomamos como nombres de archivo enviados / home / test / review.html y / home / test / xwp.out.

source: Similarly, $_FILES[ 'userfile']['size'][0] would contain review.html's filesize, and so forth.
es: Tendríamos en $HTTP_POST_FILES[ 'userfile']['name'][0] el valor de review.html, y en $HTTP_POST_FILES['userfile']['name'][1] tendríamos xwp.out; analogamente, $HTTP_POST_FILES['userfile']['size'][0] contendría el tamaño del fichero review.html, y asi sucesivamente...

source: $_FILES[ 'userfile']['name'][0], $_FILES['userfile']['tmp_name'][0], $_FILES['userfile']['size'][0], and $_FILES['userfile']['type'][0] are also set.
es: $HTTP_POST_FILES[ 'userfile']['name'][0], $HTTP_POST_FILES['userfile']['tmp_name'][0], $HTTP_POST_FILES['userfile']['size'][0] y $HTTP_POST_FILES['userfile']['type'][0] tambien son asignadas.

source: Common Pitfalls
es: Errores comunes

source: PUT method support
es: Soporte del método PUT

source: PUT method support has changed between PHP 3 and PHP 4.
es: PHP soporta el metodo HTTP PUT que usan aplicaciones como Netscape Composer y Amaya del W3C.

source: In PHP 4, one should use the standard input stream to read the contents of an HTTP PUT.
es: Las peticiones PUT son más sencillas que el método POST.

source: Example 18-4.
es: Un ejemplo:

source: PHP provides support for the HTTP PUT method used by clients such as Netscape Composer and W3C Amaya.
es: Para manipular esta petición debes decirle al servidor que esta petición sea atendida por un script PHP.

source: PUT / path / filename.html HTTP / 1.1
es: En Apache, por ejemplo, se utiliza para esto la directiva Script en los alguno de los archivos de configuración del servidor.

source: This would normally mean that the remote client would like to save the content that follows as: / path / filename.html in your web tree.
es: Un sitio típico de uso es dentro del bloque lt; Directory gt; o quizás en el bloque lt;Virtualhost gt;.

source: It is obviously not a good idea for Apache or PHP to automatically let everybody overwrite any files in your web tree.
es: Una linia así deberia hacer ésta función:

source: So, to handle such a request you have to first tell your web server that you want a certain PHP script to handle the request.
es: Ésto le dice a Apache que envíe todas peticiones PUT para URIs que contengan esta linia al script put.php.

source: It can be placed almost anywhere in your Apache configuration file.
es: Se asume que PHP se encuentra activo y con la extensión .php enlazada a él.

source: A common place is inside a Directory block or perhaps inside a Virtualhost block.
es: Dentro del script put.php3 se podría implementar algo así:

source: This tells Apache to send all PUT requests for URIs that match the context in which you put this line to the put.php script.
es: Esto copiaría el archivo a la localización requerida por el cliente remoto.

source: Inside your put.php file you would then do something like this:
es: Aqui se pueden ejecutar funciones de autentificación de usuario o cualquier otro tipo de chequeo.

source: This would copy the file to the location requested by the remote client.
es: El archivo se guarda en el archivo temporal del sistema servidor de la misma manera que el Método POST.

source: You would probably want to perform some checks and / or authenticate the user before performing this file copy.
es: Cuando la petición finaliza, el archivo temporal es eliminado.

source: When the request ends, this temporary file is deleted.
es: En consequencia el script dede proceder al trato de éste inmediatamente, ya sea para copiarlo, renombrarlo, etc.

source: The filename of this temporary file is in the $PHP_PUT_FILENAME variable, and you can see the suggested destination filename in the $REQUEST_URI (may vary on non-Apache web servers).
es: El archivo se encuentra en la variable $PHP_PUT_FILENAME, y el destino sugerido por el cliente en la variable $REQUEST_URI (puede variar en servidores web que no sean Apache).

source: This destination filename is the one that the remote client specified.
es: No es necesario hacer caso al destino sugerido por el cliente.

source: You could, for example, copy all uploaded files to a special uploads directory.
es: Por ejemplo se podrían copiar los archivos enviados a directorios especialmente designados para esta tarea.

source: Spotting References
es: Siguiente

source: In an Apache module PHP script, it is possible to use the header() function to send an "Authentication Required "message to the client browser causing it to pop up a Username / Password input window.
es: Las caracteríticas de autentificación HTTP en PHP solo estan disponibles cuando se está ejecutando como un módulo en Apache y hasta ahora no lo estan en la versión CGI.

source: These predefined variables are found in the $_SERVER and $HTTP_SERVER_VARS These predefined variables are found in the $_SERVER and $HTTP_SERVER_VARS arrays.
es: Una vez que el usuario ha rellenado el nombre y la contraseña, la URL que contiene el script PHP vuelve a ser llamada con las variables $PHP_AUTH_USER, $PHP_AUTH_PW y $PHP_AUTH_TYPE rellenas con el nombre de usuario, la contraseña y el tipo de autentificación respectivamente.

source: Only "Basic" authentication is supported.
es: Sólo autentificación "Básica" esta soportada en este momento.

source: PHP Version Note:
es: Consulte la función header() para más información.

source: An example script fragment which would force client authentication on a page is as follows:
es: Un fragmento de script de ejmplo que fuerce la autentificación del cliente en una página sería como el siguiente:

source: Example 16-1.
es: Ejemplo 16-1.

source: HTTP Authentication example
es: Ejemplo de autentificación HTTP

source: Basic realm=" My Realm"'); header('HTTP / 1.0 401 Unauthorized'); echo'Text to send if user hits Cancel button'; exit;} else {echo "p Hello {$_SERVER['PHP_AUTH_USER']}. / p"; echo "p You entered {$_SERVER['PHP_AUTH_PW']} as your password. / p";}?
es: Basic realm=\" My Realm\""); header("HTTP / 1.0 401 Unauthorized"); echo "Text to send if user hits Cancel button\n"; exit;} else {echo "p Hello {$_SERVER['PHP_AUTH_USER']}. / p"; echo "p You entered {$_SERVER['$PHP_AUTH_PW']} as your password. / p";}?

source: Compatibility Note:
es: Nota:

source: Please be careful when coding the HTTP header lines.
es: Por favor tener cuidado cuando esteis programando las lines de cabecera HTTP.

source: In order to guarantee maximum compatibility with all clients, the keyword "Basic" should be written with an uppercase "B", the realm string must be enclosed in double (not single) quotes, and exactly one space should precede the 401 code in the HTTP / 1.0 401 header line.
es: Para garantizar la maxima compatibilidad con todos los clientes, la palabra clave "Basic" debe de ser escrita con "B "mayúscula, la cadena de texto debe estar incluida entre comillas dobles (no simples) y un espacio debe preceder el código "401" en la linea de cabecera "HTTP / 1.0 401 "

source: Instead of simply printing out PHP_AUTH_USER and PHP_AUTH_PW, as done in the above example, you may want to check the username and password for validity.
es: En vez de, sencillamente, mostrar $PHP_AUTH_USER y $PHP_AUTH_PW, seguramente querais comprobar la validez del nombre de usuario y la contraseña.

source: Perhaps by sending a query to a database, or by looking up the user in a dbm file.
es: Tal vez enviando una consulta a una base de datos o buscando el usuario en un fichero dbm.

source: Watch out for buggy Internet Explorer browsers out there.
es: Vigilar aquí los navegadores Interner Explorer con bugs.

source: They seem very picky about the order of the headers.
es: Parecen muy quisquillosos con el orden de las cabeceras.

source: Sending the WWW-Authenticate header before the HTTP / 1.0 401 header seems to do the trick for now.
es: Enviar la cabecera WWW-Autentificación antes que la cabecera HTTP / 1.0 401 parece ser el truco por ahora.

source: As of PHP 4.3.0, in order to prevent someone from writing a script which reveals the password for a page that was authenticated through a traditional external mechanism, the PHP_AUTH variables will not be set if external authentication is enabled for that particular page and safe mode is enabled.
es: Para prevenir que alguien escriba un script que revele la contraseña de una página que ha sido autentificada a través de algún mecanismo externo tradicional, las variables PHP_AUTH no serán rellenadas si algún tipo de autentificación externo ha sido activado para una página en particular.
